main/puml/HybridBichard.puml
@startuml
set separator none
title Hybrid Bichard

top to bottom direction

!include <C4/C4>
!include <C4/C4_Context>
!include <C4/C4_Container>

Person(PoliceUser, "Police User", $descr="", $tags="", $link="")
System(CJSM, "CJSM", $descr="Criminal Justice Secure Mail", $tags="", $link="")
System(PNC, "PNC", $descr="Police National Computer", $tags="", $link="")
System(LEDS, "LEDS", $descr="Law Enforcement Data System", $tags="", $link="")
System(NIAM, "NIAM", $descr="National Identity Access Management service", $tags="", $link="")
System(PSNProxy, "PSN Proxy", $descr="Q-Solution", $tags="", $link="")
System(ExISS, "ExISS", $descr="Exchange Integrated Shared Services", $tags="", $link="")

System_Boundary("Bichard_boundary", "Bichard", $tags="") {
  ContainerDb(Bichard.DynamoDB, "DynamoDB", $techn="", $descr="", $tags="", $link="")
  Container(Bichard.Beanconnect, "Beanconnect", $techn="", $descr="Acts as a bridge between Java EE applications (Enterprise JavaBeans or servlets) and SAP backend systems", $tags="", $link="")
  Container(Bichard.MessageTransferLambda, "Message Transfer Lambda", $techn="Typescript", $descr="", $tags="", $link="")
  Container(Bichard.EventHandlerStepFunction, "Event Handler Step Function", $techn="", $descr="", $tags="", $link="")
  ContainerQueue(Bichard.ActiveMQ, "Active MQ", $techn="Active MQ", $descr="", $tags="", $link="")
  Container(Bichard.NginxAuthProxy, "Nginx Auth Proxy", $techn="Nginx", $descr="", $tags="", $link="")
  ContainerDb(Bichard.BichardDatabase, "Bichard Database", $techn="PostgreSQL", $descr="", $tags="", $link="")
  Container(Bichard.EmailSystem, "Email System", $techn="Postfix", $descr="", $tags="", $link="")
  Container(Bichard.AuditLogAPI, "Audit Log API", $techn="Typescript", $descr="", $tags="", $link="")
  Container(Bichard.MessageForwarder, "Message Forwarder", $techn="Typescript", $descr="Polls and forwards MQ messages to old Bichard queues or conductor", $tags="", $link="")
  Container(Bichard.BichardJavaApplication, "Bichard Java Application", $techn="Java EE", $descr="", $tags="", $link="")
  Container(Bichard.PNCAPI, "PNC API", $techn="Java EE", $descr="", $tags="", $link="")
  Container(Bichard.BichardUserService, "Bichard User Service", $techn="Next.js, TypeScript & React", $descr="An application to provide user authentication and user management", $tags="", $link="")
  Container(Bichard.StaticFileService, "Static File Service", $techn="", $descr="", $tags="", $link="")
  Container(Bichard.Reporting, "Reporting", $techn="", $descr="", $tags="", $link="")
  Container(Bichard.Monitoring, "Monitoring", $techn="", $descr="", $tags="", $link="")
  Container(Bichard.BichardUI, "Bichard UI", $techn="TypeScript & React", $descr="A new way of interacting with Bichard, complying with Gov.uk standards", $tags="", $link="")
  Container(Bichard.Conductor, "Conductor", $techn="", $descr="", $tags="", $link="")
  Container(Bichard.BichardAPI, "Bichard API", $techn="TypeScript, Fastify & Zod", $descr="An API to remove DB actions from UI and to be Audit Logs", $tags="", $link="")
  Container(Bichard.LEDSProxy, "LEDS Proxy", $techn="", $descr="", $tags="", $link="")
}

Rel(Bichard.ActiveMQ, Bichard.MessageForwarder, "", $techn="", $tags="", $link="")
Rel(Bichard.MessageForwarder, Bichard.ActiveMQ, "", $techn="", $tags="", $link="")
Rel(Bichard.MessageForwarder, Bichard.Conductor, "", $techn="", $tags="", $link="")
Rel(Bichard.BichardAPI, Bichard.DynamoDB, "", $techn="", $tags="", $link="")
Rel(Bichard.BichardAPI, Bichard.LEDSProxy, "Encrypted via HTTPS", $techn="", $tags="", $link="")
Rel(Bichard.BichardAPI, NIAM, "via Internet", $techn="Gets auth token to access LEDS API", $tags="", $link="")
Rel(Bichard.Reporting, Bichard.BichardAPI, "", $techn="", $tags="", $link="")
Rel(Bichard.Reporting, Bichard.BichardDatabase, "", $techn="", $tags="", $link="")
Rel(Bichard.Reporting, Bichard.StaticFileService, "", $techn="Stores generated reports in the S3 bucket", $tags="", $link="")
Rel(Bichard.NginxAuthProxy, Bichard.BichardUI, "", $techn="", $tags="", $link="")
Rel(Bichard.BichardUI, Bichard.BichardDatabase, "", $techn="", $tags="", $link="")
Rel(Bichard.BichardUI, Bichard.BichardAPI, "", $techn="", $tags="", $link="")
Rel(Bichard.BichardUI, Bichard.AuditLogAPI, "", $techn="", $tags="", $link="")
Rel(Bichard.BichardUI, Bichard.ActiveMQ, "Resubmits to Phase 1 or 2 via Message Forwarder", $techn="", $tags="", $link="")
Rel(Bichard.PNCAPI, Bichard.Beanconnect, "", $techn="", $tags="", $link="")
Rel(Bichard.Conductor, Bichard.BichardDatabase, "", $techn="", $tags="", $link="")
Rel(Bichard.MessageTransferLambda, Bichard.Conductor, "", $techn="", $tags="", $link="")
Rel(Bichard.Conductor, Bichard.PNCAPI, "Queries PNC by ASN", $techn="", $tags="", $link="")
Rel(Bichard.Conductor, Bichard.EmailSystem, "Alert Common Platform", $techn="When incoming message format is invalid, Common Platform is notified via email", $tags="", $link="")
Rel(Bichard.BichardAPI, Bichard.Conductor, "Resubmits court case", $techn="", $tags="", $link="")
Rel(Bichard.LEDSProxy, LEDS, "", $techn="Encrypted via mTLS", $tags="", $link="")
Rel(PoliceUser, PNC, "Uses", $techn="", $tags="", $link="")
Rel(PoliceUser, LEDS, "Uses", $techn="", $tags="", $link="")
Rel(PoliceUser, Bichard.NginxAuthProxy, "Uses", $techn="", $tags="", $link="")
Rel(CJSM, PoliceUser, "Gets email", $techn="", $tags="", $link="")
Rel(PSNProxy, PNC, "Uses", $techn="", $tags="", $link="")
Rel(Bichard.BichardJavaApplication, Bichard.PNCAPI, "", $techn="", $tags="", $link="")
Rel(Bichard.Beanconnect, PSNProxy, "", $techn="", $tags="", $link="")
Rel(Bichard.EmailSystem, CJSM, "via Internet", $techn="Sends verification code / Notifies the Common Platform about invalid incoming messages", $tags="", $link="")
Rel(Bichard.BichardUserService, Bichard.EmailSystem, "Sends verification code", $techn="", $tags="", $link="")
Rel(Bichard.NginxAuthProxy, Bichard.BichardJavaApplication, "", $techn="", $tags="", $link="")
Rel(Bichard.NginxAuthProxy, Bichard.BichardUserService, "Uses", $techn="", $tags="", $link="")
Rel(Bichard.NginxAuthProxy, Bichard.StaticFileService, "", $techn="Fetches reports and help pages", $tags="", $link="")
Rel(Bichard.BichardUserService, Bichard.BichardDatabase, "Reads from / Writes to", $techn="", $tags="", $link="")
Rel(Bichard.BichardJavaApplication, Bichard.BichardDatabase, "Reads from / Writes to", $techn="", $tags="", $link="")
Rel(Bichard.BichardAPI, Bichard.BichardDatabase, "Reads from / Writes to", $techn="", $tags="", $link="")
Rel(ExISS, Bichard.MessageTransferLambda, "", $techn="", $tags="", $link="")
Rel(Bichard.ActiveMQ, Bichard.BichardJavaApplication, "", $techn="", $tags="", $link="")
Rel(Bichard.BichardJavaApplication, Bichard.ActiveMQ, "", $techn="", $tags="", $link="")
Rel(Bichard.ActiveMQ, Bichard.EventHandlerStepFunction, "", $techn="", $tags="", $link="")
Rel(Bichard.EventHandlerStepFunction, Bichard.AuditLogAPI, "", $techn="", $tags="", $link="")
Rel(Bichard.AuditLogAPI, Bichard.DynamoDB, "", $techn="", $tags="", $link="")
Rel(Bichard.AuditLogAPI, Bichard.BichardDatabase, "", $techn="", $tags="", $link="")

SHOW_LEGEND(true)
@enduml
